Revit 2015 API
ComponentRepeater.RepeatElements Method
 Repeats a set of adaptive component hosted on one or more repeating references.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Since: 2014
Syntax
C#
public static IList<ComponentRepeater> RepeatElements(
	Document document,
	ICollection<ElementId> elementIds
)
Visual Basic
Public Shared Function RepeatElements ( _
	document As Document, _
	elementIds As ICollection(Of ElementId) _
) As IList(Of ComponentRepeater)
Visual C++
public:
static IList<ComponentRepeater^>^ RepeatElements(
	Document^ document,
	ICollection<ElementId^>^ elementIds
)
Parameters
document
Type: Autodesk.Revit.DB.Document
 The document that contains the element.
elementIds
Type: System.Collections.Generic.ICollection<ElementId>
 The set of adaptive components used as an input pattern for the repeating operation.
Return Value
 One or more component repeater objects representing the result pattern of the repeating operation.
Remarks
 All elements must be adaptive family instances, have no shape handles, and have at least one placement point hosted on a 1D or 2D repeating reference. The remaining placement points must be either unhosted or hosted on another repeating reference.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  The document does not allow creation of a component repeater. -or- The given element id set is empty. -or- One or more elements in elementIds do not exist in the document. -or- Some of the elements cannot be repeated. All elements must be adaptive family instances, have no shape handles, and have at least one placement point hosted on a 1D or 2D repeating reference. The remaining placement points must be either unhosted or hosted on another repeating reference.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was NULL
Autodesk.Revit.Exceptions.ModificationForbiddenException |  The document is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements). -or- The document is being loaded, or is in the midst of another sensitive process.
Autodesk.Revit.Exceptions.ModificationOutsideTransactionException |  The document has no open transaction.
See Also
ComponentRepeater Class
Autodesk.Revit.DB Namespace